# Parameter Type Id Rebar Shape Crank Start Ratio Property

Source: https://www.revitapidocs.com/2026/f0a316f3-2371-90d7-b85d-2a6abf76fe03.htm

---

| Parameter Type Id Rebar Shape Crank Start Ratio Property |
| --- |

"Start Crank Slope 1:"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankStartRatio { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankStartRatio As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankStartRatio {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankStartRatio : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace